In [1]:
import pandas as pd
from pandasql import sqldf

In [2]:
df = pd.read_csv('us_cities.csv')
df.head()

   ID STATE_CODE STATE_NAME      CITY          COUNTY   LATITUDE   LONGITUDE
0   1         AK     Alaska      Adak  Aleutians West  55.999722 -161.207778
1   2         AK     Alaska  Akiachak          Bethel  60.891854 -161.392330
2   3         AK     Alaska     Akiak          Bethel  60.890632 -161.199325
3   4         AK     Alaska    Akutan  Aleutians East  54.143012 -165.785368
4   5         AK     Alaska  Alakanuk        Kusilvak  62.746967 -164.602280

## Weather Observation Station 4

In [3]:
q = "SELECT COUNT(CITY) FROM df"
p = "SELECT COUNT(DISTINCT CITY) FROM df"

print(sqldf(q, globals()))
print("\n")
print(sqldf(p, globals()))

   COUNT(CITY)
0        29880


   COUNT(DISTINCT CITY)
0                 18720

In [4]:
q = "SELECT COUNT(CITY) - COUNT(DISTINCT CITY) AS DIFFERENCE FROM df"

sqldf(q, globals())

   DIFFERENCE
0       11160

## Weather Observation Station 5

<img src = "Weather Observation Station 5.png">

min length 

max length 

which city name comes first (So city must be in ascending order)

In [5]:
a = "SELECT CITY FROM df ORDER BY CITY ASC"

sqldf(a, globals()).head()

         CITY
0  Aaronsburg
1   Abbeville
2   Abbeville
3   Abbeville
4   Abbeville

In [6]:
x = "SELECT CITY, LENGTH(CITY) FROM df ORDER BY LENGTH(CITY) DESC"
sqldf(x, globals()).head()

                          CITY  LENGTH(CITY)
0  Tripler Army Medical Center            27
1   Little Rock Air Force Base            26
2   Kiamichi Christian Mission            26
3   King And Queen Court House            26
4    Hot Springs National Park            25

In [7]:
x = "SELECT CITY, LENGTH(CITY) FROM df ORDER BY LENGTH(CITY) DESC, CITY ASC LIMIT 1"
sqldf(x, globals()).head()

                          CITY  LENGTH(CITY)
0  Tripler Army Medical Center            27

In [8]:
y = "SELECT CITY, LENGTH(CITY) FROM df ORDER BY LENGTH(CITY) ASC, CITY ASC LIMIT 1"
sqldf(y, globals())

  CITY  LENGTH(CITY)
0  Ace             3

## Weather Observation Station 6

<img src = "Weather Observation Station 6.png">

In [9]:
# p = 'select distinct city from df where REGEXP_LIKE(lower(city), "^[aeiou]")'
# sqldf(p, globals())

## Weather Observation Station 7

<img src = "Weather Observation Station 7.png">

In [10]:
# p = 'select distinct city from df where REGEXP_LIKE(lower(city), "[aeiou]$")'
# sqldf(p, globals())

In [11]:
'''
^[aeiou] --> compares with the starting letter 

[aeiou]$ --> compares with the ending letter
'''

'\n^[aeiou] --> compares with the starting letter \n\n[aeiou]$ --> compares with the ending letter\n'

## Weather Observation Station 8

<img src = "Weather Observation Station 8.png">

In [12]:
# select distinct city from station 
# where 
#     REGEXP_LIKE(lower(city), "^[aeiou]") and 
#     REGEXP_LIKE(lower(city), "[aeiou]$")

## Weather Observation Station 9

<img src = "Weather Observation Station 9.png">

In [13]:
# select distinct city from df 
# where not
#      REGEXP_LIKE(lower(city), "^[aeiou]")

## Weather Observation Station 10

<img src = "Weather Observation Station 10.png">

In [14]:
# select distinct city from df 
# where not
#      REGEXP_LIKE(lower(city), "[aeiou]$")

## Weather Observation Station 11

<img src = "Weather Observation Station 11.png">

In [15]:
# select distinct city from station 
# where not regexp_like(lower(city), '^[aeiou]') or 
#           not regexp_like(lower(city), '[aeiou]$')

## Weather Observation Station 12

<img src = "Weather Observation Station 12.png">

In [16]:
# select distinct city from station 
# where not regexp_like(lower(city), '^[aeiou]') and
#           not regexp_like(lower(city), '[aeiou]$')

## Higher Than 75 Marks

<img src = "Higher Than 75 Marks.png">